import sys
sys.stdin = open('20500.txt')

'''
1자리수 : 0 => 1000000007의 나머지 : 0 
배수 : x
2자리수 : 1 => 1000000007의 나머지 : 1
배수 : 15
3자리수 : 1 => 1000000007의 나머지 : 1
배수 : 555
4자리수 : 3 => 1000000007의 나머지 : 3
배수 : 1155, 1515, 5115
5자리수 : 5 => 1000000007의 나머지 : 5
배수 : 11115, 15555, 51555, 55155, 55515
6자리수 : 11 => 1000000007의 나머지 : 11
배수 : 111555, 115155, 115515, 151155, 151515, 155115, 511155, 511515, 515115, 551115, 555555
7자리수 : 21 => 1000000007의 나머지 : 21
8자리수 : 43 => 1000000007의 나머지 : 43
여기서 규칙이 보인다
홀수 => 전꺼 *2 - 1
짝수 => 전꺼 *2 + 1
'''

# data = []
# for i in range(10000000, 100000000):
#     exist = False
#     if i%15 == 0:
#         for j in list(str(i)):
#             if int(j) == 1 or int(j) == 5:
#                 pass
#             else:
#                 exist = True
#                 break
#         if exist == False:
#             data.append(i)
# print(len(data))

n = int(input())
num = [0] * (n+1)
for i in range(2, n+1):
    if i % 2 == 0:
        num[i] = (num[i-1]*2 + 1)%1000000007
    else:
        num[i] = (num[i-1]*2 - 1)%1000000007

print(num[n])